<template>
  <div id="scrum">
    <h1>Scrum</h1>
    <p>
      Scrum - структура управления проектами, в которой поставленная цель достигается путём хорошей командной работы,
      ответственности и итеративным прогрессом. В основе Scrum лежит эмпиризм, который утверждает, что знания приходят
      из опыта и решения надо принимать из того, что известно. У Scrum есть три составляющих:
    </p>
    <ol>
      <li>Прозрачность</li>
      <li>Контроль</li>
      <li>Адаптация</li>
    </ol>
    <p>
      Так же, при методологии Scrum обновления приходят постепенно, что позволяет получать отзыв от пользователя и в
      последующем обновлении исправить недочёты, в отличии от Waterfall, где просто один большой релиз. Scrum
      характеризуется как:
    </p>
    <ol>
      <li>Легкий</li>
      <li>Прост в изучении</li>
      <li>Труден в освоении</li>
    </ol>
    <p>
      Плюсы Scrum:
    </p>
    <ol>
      <li>Лучше качество</li>
      <li>Меньше времени на выход</li>
      <li>Повышенная рентабельность</li>
      <li>Высокий дух команды</li>
      <li>Улучшенная командная работа</li>
    </ol>
    <p>Роли в Scrum:</p>
    <ol>
      <li><strong>Scrum мастер</strong> - помогает команде следовать целям, устраняет и защищает команду от внешних
        вмешательств, помогает сотрудничеству между командой и инвесторами, сохраняет здравый смысл в команде, защищает
        от отвлекающих факторов.
      </li>
      <li><strong>Владелец</strong> - разрабатывает стратегии для сервисов и продуктов, включая краткосрочные и
        долгосрочные цели, предоставляет доступ к продукту или услуге, понимает и объясняет клиенту потребности команды
        разработчиков, расставляет приореты и управляет требованиями, берёт на себя ответственности и обязанности
        свзяанные с бюджетом, определяет дату выпуска функций или услуг, работает с разработчиками ежедневно для ответов
        на вопросы и для принятия решений, принимать или отклонять завершённые фичи относящиеся к спринту, показывает
        реализации после каждого спринта, ответственный за беклоги продукта.
      </li>
      <li><strong>Scrum команда</strong> - команда разработчиков из 3-9 человек у которых должны быть одинаковые знания
        в той области, в которой они будут работать. Команда должна быть организованной и кросс функциональной, владелец
        продукта должен иметь видиние для доноса потребностей до команды.
      </li>
    </ol>
  </div>
</template>

<script>
export default {
  name: "Scrum"
}
</script>

<style scoped lang="scss">
p {
  overflow: hidden;
  text-overflow: ellipsis;
  word-wrap: break-word;
  max-width: 90%;
}
</style>