<template>
  <div id="stories-rus">
    <h1>User Stories для проекта "Wish List"</h1>
    <ol>
      <li>Как разработчик, я хочу использовать эндпоинты с желаниями пользователя.</li>
      <li>Как пользователь, я хочу управлять своими желаниями.</li>
      <li>Как пользователь, я хочу видеть желания пользователей, которых я отслеживаю.</li>
      <li>Как пользователь, я хочу изменять свой профиль.</li>
      <li>Как разработчик, я хочу использовать эндпоинты связанные с профилем.</li>
      <li>Как разработчик, я хочу использовать эндпоинты с желаниями пользователей, которые отслеживают конкретного пользователя.</li>
      <li>Как пользователь, я хочу видеть желания всех пользователей и получать предложения о желаниях.</li>
      <li>Как разработчик, я хочу использовать эндпоинты для предложения желаний.</li>
    </ol>
  </div>
</template>

<script>
export default {
  name: "Stories-rus"
}
</script>

<style scoped lang="scss">
ol {
  overflow: hidden;
  text-overflow: ellipsis;
  word-wrap: break-word;
  max-width: 90%;
}
</style>